anujdeshpande/client-sdk-esp32/components/livekit/examples/custom_hardware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Credentials ---
# See README.md for setup instructions.
# CONFIG_LK_EXAMPLE_USE_SANDBOX=y
# CONFIG_LK_EXAMPLE_SANDBOX_ID="my-project-xxxxxx"
CONFIG_LK_EXAMPLE_USE_PREGENERATED=y
CONFIG_LK_EXAMPLE_SERVER_URL="ws://localhost:7880"
# CONFIG_LK_EXAMPLE_TOKEN="your-jwt-token"

#
# LiveKit SDK settings — required regardless of board
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
# Required by esp_peer on IDF v6 (option does not exist on IDF v5 and is ignored)
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_PARTITION_TABLE_CUSTOM=y

#
# Board-specific — Waveshare ESP32-S3-Touch-LCD-1.83
# Adapt these settings to match your board's flash, PSRAM, and cache.
#
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=85
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# IDF v6.1 removed some cross-signing roots from its certificate bundle; needed
# to verify LiveKit Cloud certificates (option does not exist on earlier IDF)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
